Autodesk.Revit.DB.Curve.CreateOffset(System.Double,Autodesk.Revit.DB.XYZ)
Creates a new curve that is an offset of the existing curve.
offsetDist:
The signed distance of the offset.
normal:
The normal of the plane defining the offset direction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot create the offset of the curve.
Returns:
The new curve.
Since:
2015
Remarks:
The offset curve is theoretically defined by translating every point of the original curve by the vector offsetDist * (curveTan x normal)
of the curve by the signed offset distance offsetDist, within the plane of the curve. The "right" side of the curve at a given point on the
curve is defined with reference to normal being thought of as the upward direction and curveTan being thought of as the forward direction,
as if you are walking along the curve. It follows that if offsetDist is positive, points will be offset to the right of the curve, whereas
if offsetDist is negative, points will be offset to the left of the curve.
Note that for elliptical fragments and NurbSpline curves, the offset will be created as a HermiteSpline. This method does not support offset
of full cyclic ellipses.